Revit 2026 API

# ElectricalSettingWireMaterialTypes Property

---

**Note: This API is now obsolete.**

Get electrical wire material types information of the project.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("Property WireMaterialTypes is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.GetConductorMaterialIds() instead.")]
public WireMaterialTypeSet WireMaterialTypes { get; }
```
```vb
<ObsoleteAttribute("Property WireMaterialTypes is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.GetConductorMaterialIds() instead.")>
Public ReadOnly Property WireMaterialTypes As WireMaterialTypeSet
	Get
```
```cpp
public:
[ObsoleteAttribute(L"Property WireMaterialTypes is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.GetConductorMaterialIds() instead.")]
property WireMaterialTypeSet^ WireMaterialTypes {
	WireMaterialTypeSet^ get ();
}
```
```fsharp
[<ObsoleteAttribute("Property WireMaterialTypes is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial.GetConductorMaterialIds() instead.")>]
member WireMaterialTypes : WireMaterialTypeSet with get
```

#### Property Value

WireMaterialTypeSet

#### Reference

ElectricalSetting Class

Autodesk.Revit.DB.Electrical Namespace